In [1]:
lambda c: (c*(9/5))+32

In [2]:
c2f = lambda c: (c*(9/5))+32
c2f(100)

212.0

In [3]:
t = [0,10,20,30,100]
f = map(lambda c: (c*(9/5))+32 , t)
list(f)

[32.0, 50.0, 68.0, 86.0, 212.0]

In [4]:
import pandas as pd
pd.__version__

'2.1.4'

In [5]:
df=pd.DataFrame({'celsius' : t})
df

   celsius
0        0
1       10
2       20
3       30
4      100

In [6]:
df.celsius * 9/5 +32

0     32.0
1     50.0
2     68.0
3     86.0
4    212.0
Name: celsius, dtype: float64

In [7]:
df.celsius.map(lambda c: c* 9/5 +32)

0     32.0
1     50.0
2     68.0
3     86.0
4    212.0
Name: celsius, dtype: float64

In [8]:
%timeit -n1000 df.celsius * 9/5 +32

93.5 µs ± 6.88 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [9]:
%timeit -n1000 df.celsius.map(lambda c: c* 9/5 +32)

23.9 µs ± 1.35 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [10]:
df.celsius.apply(lambda c: c* 9/5 +32)

0     32.0
1     50.0
2     68.0
3     86.0
4    212.0
Name: celsius, dtype: float64

In [11]:
%timeit -n1000 df.celsius.apply(lambda c: c* 9/5 +32)

29.5 µs ± 2.93 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [12]:
df['fah'] = df.celsius.map(lambda c: c* 9/5 +32)
df

   celsius    fah
0        0   32.0
1       10   50.0
2       20   68.0
3       30   86.0
4      100  212.0

In [13]:
a = [['A432',	91,	97,	83],
['C747',	94,	94,	58],
['C751',	74,	55,	89],
['B716',	63,	89,	93],
['A623',	90,	73,	81],
['B394',	76,	91,	90],
['A294',	90,	86,	94],
['B318',	62,	57,	55],
['B164',	79,	57,	89],
['A126',	89,	82,	85]]
a

[['A432', 91, 97, 83],
 ['C747', 94, 94, 58],
 ['C751', 74, 55, 89],
 ['B716', 63, 89, 93],
 ['A623', 90, 73, 81],
 ['B394', 76, 91, 90],
 ['A294', 90, 86, 94],
 ['B318', 62, 57, 55],
 ['B164', 79, 57, 89],
 ['A126', 89, 82, 85]]

In [14]:
df1= pd.DataFrame(a)
df1

      0   1   2   3
0  A432  91  97  83
1  C747  94  94  58
2  C751  74  55  89
3  B716  63  89  93
4  A623  90  73  81
5  B394  76  91  90
6  A294  90  86  94
7  B318  62  57  55
8  B164  79  57  89
9  A126  89  82  85

In [15]:
b = ['applicantID','eng','math','interview']
df1.columns = b
df1

  applicantID  eng  math  interview
0        A432   91    97         83
1        C747   94    94         58
2        C751   74    55         89
3        B716   63    89         93
4        A623   90    73         81
5        B394   76    91         90
6        A294   90    86         94
7        B318   62    57         55
8        B164   79    57         89
9        A126   89    82         85

In [16]:
# series : use map
df1.eng.map(lambda s: 'pass' if s >= 80 else 'fail')

0    pass
1    pass
2    fail
3    fail
4    pass
5    fail
6    pass
7    fail
8    fail
9    pass
Name: eng, dtype: object

In [17]:
# multiple series : use apply
df1.apply(lambda s: 'pass' if s.eng >=80 and s.math >= 75 else 'fail',axis = 1)

0    pass
1    pass
2    fail
3    fail
4    fail
5    fail
6    pass
7    fail
8    fail
9    pass
dtype: object

In [18]:
df1['eng_math']=df1.apply(lambda s: 'pass' if s.eng >=80 and s.math >= 75 else 'fail',axis = 1)
df1

  applicantID  eng  math  interview eng_math
0        A432   91    97         83     pass
1        C747   94    94         58     pass
2        C751   74    55         89     fail
3        B716   63    89         93     fail
4        A623   90    73         81     fail
5        B394   76    91         90     fail
6        A294   90    86         94     pass
7        B318   62    57         55     fail
8        B164   79    57         89     fail
9        A126   89    82         85     pass

In [19]:
df1['qualify']=df1.apply(lambda s: 'pass' if s.eng >=80 and s.math >= 75 and s.interview > 60 else 'fail',axis = 1)
df1

  applicantID  eng  math  interview eng_math qualify
0        A432   91    97         83     pass    pass
1        C747   94    94         58     pass    fail
2        C751   74    55         89     fail    fail
3        B716   63    89         93     fail    fail
4        A623   90    73         81     fail    fail
5        B394   76    91         90     fail    fail
6        A294   90    86         94     pass    pass
7        B318   62    57         55     fail    fail
8        B164   79    57         89     fail    fail
9        A126   89    82         85     pass    pass

In [20]:
df1['score1']=df1.apply(lambda s: s.eng * .5 + s.math * .3 + s.interview * .2, axis=1)
df1

  applicantID  eng  math  interview eng_math qualify  score1
0        A432   91    97         83     pass    pass    91.2
1        C747   94    94         58     pass    fail    86.8
2        C751   74    55         89     fail    fail    71.3
3        B716   63    89         93     fail    fail    76.8
4        A623   90    73         81     fail    fail    83.1
5        B394   76    91         90     fail    fail    83.3
6        A294   90    86         94     pass    pass    89.6
7        B318   62    57         55     fail    fail    59.1
8        B164   79    57         89     fail    fail    74.4
9        A126   89    82         85     pass    pass    86.1

In [21]:
df1['score2']=df1.eng * .5 + df1.math * .3 + df1.interview * .2
df1

  applicantID  eng  math  interview eng_math qualify  score1  score2
0        A432   91    97         83     pass    pass    91.2    91.2
1        C747   94    94         58     pass    fail    86.8    86.8
2        C751   74    55         89     fail    fail    71.3    71.3
3        B716   63    89         93     fail    fail    76.8    76.8
4        A623   90    73         81     fail    fail    83.1    83.1
5        B394   76    91         90     fail    fail    83.3    83.3
6        A294   90    86         94     pass    pass    89.6    89.6
7        B318   62    57         55     fail    fail    59.1    59.1
8        B164   79    57         89     fail    fail    74.4    74.4
9        A126   89    82         85     pass    pass    86.1    86.1

In [22]:
%timeit -n100 df1.apply(lambda s: s.eng * .5 + s.math * .3 + s.interview * .2, axis=1)

249 µs ± 38.6 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [23]:
%timeit -n100 df1.eng * .5 + df1.math * .3 + df1.interview * .2

172 µs ± 15.7 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)